# Задача №2
# a = int(input("Начало диапазона:"))
# b = int(input("Конец диапазона:"))
# for i in range(a, b+1):
#     if(i % 2 != 0):
#         print(i)

# Задача №3


# еще не завершено
#
# while n != ch: # n рандомное число
#
#     ch = int(input("Твое число: ")) #вводимое число
#     kol # количество попыток
#
#
#     if n > ch:
#         print("Задуманное число больше\n")
#     elif n < ch:
#         print("Задуманное число меньше\n")
#     else:
#         print("Поздравляю! Ты угадал!")
#         print("Число шагов: ", kol)