# Задача №4
# print("Введите элементы списка: ")
# a = [int(input("-> ")) for i in range(int(input("n = ")))]
# print(a)
# print("Введите число : ")
# ch = int(input("ch = "))
# for i in a:
#    if a.count(ch) !=0:
#     print("Число присутствует в элементах списка")
#     break
# else:
#     print("Числа НЕТ в элементах списка")

#Задача №3
# a =[95, 10, 13, -7, 31, 25, 9, 100, 8, 7 ]
# print(a)
# a.sort(reverse=True)
# print(a)

# Задача№2
# print("Введите элементы списка: ")
# a = [int(input("-> ")) for i in range(int(input("n = ")))]
# print(a)
# print("Введите индекс : ")
# k = int(input("k = "))
# print("Введите значение : ")
# c = int(input("c = "))
# a.insert(k, c)
# print(a)

# Задача №1
# a = [int(input("Введите элемент списка: ")) for i in range(int(input("Введите длину списка: ")))]
# print("Список: ",a)
# s = []
# for i in a:
#     if i >= 0:
#         s.append(i)
# print("Новый список, состоящий из положительных элементов: ", s)
# s.sort()
# print("Наибольший элемент списка: ",s[-1])
















